MikroElektronika/core_packages/PIC/XC8/def/PIC16F639/mcu.h
#define                                 VR1_bit             _BIT_ACCESS(VRCON,1)
// VRCON<VR2>
extern volatile __bit                   VR2                 __at(0x4CA);	// @ (0x99 * 8 + 2)
#define                                 VR2_bit             _BIT_ACCESS(VRCON,2)
// VRCON<VR3>
extern volatile __bit                   VR3                 __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 VR3_bit             _BIT_ACCESS(VRCON,3)
// VRCON<VREN>
extern volatile __bit                   VREN                __at(0x4CF);	// @ (0x99 * 8 + 7)
#define                                 VREN_bit            _BIT_ACCESS(VRCON,7)
// VRCON<VRR>
extern volatile __bit                   VRR                 __at(0x4CD);	// @ (0x99 * 8 + 5)
#define                                 VRR_bit             _BIT_ACCESS(VRCON,5)
// WDA<WDA0>
extern volatile __bit                   WDA0                __at(0x4B8);	// @ (0x97 * 8 + 0)
#define                                 WDA0_bit            _BIT_ACCESS(WDA,0)
// WDA<WDA1>
extern volatile __bit                   WDA1                __at(0x4B9);	// @ (0x97 * 8 + 1)
#define                                 WDA1_bit            _BIT_ACCESS(WDA,1)
// WDA<WDA2>
extern volatile __bit                   WDA2                __at(0x4BA);	// @ (0x97 * 8 + 2)
#define                                 WDA2_bit            _BIT_ACCESS(WDA,2)
// WDA<WDA4>
extern volatile __bit                   WDA4                __at(0x4BC);	// @ (0x97 * 8 + 4)
#define                                 WDA4_bit            _BIT_ACCESS(WDA,4)
// WDA<WDA5>
extern volatile __bit                   WDA5                __at(0x4BD);	// @ (0x97 * 8 + 5)
#define                                 WDA5_bit            _BIT_ACCESS(WDA,5)
// WDTCON<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0xC1);	// @ (0x18 * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON,1)
// WDTCON<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0xC2);	// @ (0x18 * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON,2)
// WDTCON<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0xC3);	// @ (0x18 * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON,3)
// WDTCON<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON,4)
// WPUDA<WPUDA0>
extern volatile __bit                   WPUDA0              __at(0x4A8);	// @ (0x95 * 8 + 0)
#define                                 WPUDA0_bit          _BIT_ACCESS(WPUDA,0)
// WPUDA<WPUDA1>
extern volatile __bit                   WPUDA1              __at(0x4A9);	// @ (0x95 * 8 + 1)
#define                                 WPUDA1_bit          _BIT_ACCESS(WPUDA,1)
// WPUDA<WPUDA2>
extern volatile __bit                   WPUDA2              __at(0x4AA);	// @ (0x95 * 8 + 2)
#define                                 WPUDA2_bit          _BIT_ACCESS(WPUDA,2)
// WPUDA<WPUDA4>
extern volatile __bit                   WPUDA4              __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 WPUDA4_bit          _BIT_ACCESS(WPUDA,4)
// WPUDA<WPUDA5>
extern volatile __bit                   WPUDA5              __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 WPUDA5_bit          _BIT_ACCESS(WPUDA,5)
// EECON1<WR>
extern volatile __bit                   WR                  __at(0x4E1);	// @ (0x9C * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(EECON1,1)
// EECON1<WREN>
extern volatile __bit                   WREN                __at(0x4E2);	// @ (0x9C * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON1,2)
// EECON1<WRERR>
extern volatile __bit                   WRERR               __at(0x4E3);	// @ (0x9C * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON1,3)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1A);	// @ (0x3 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// PCON<nBOD>
extern volatile __bit                   nBOD                __at(0x470);	// @ (0x8E * 8 + 0)
#define                                 nBOD_bit            _BIT_ACCESS(PCON,0)
// PCON<nBOR>
extern volatile __bit                   nBOR                __at(0x470);	// @ (0x8E * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON,0)
// STATUS<nPD>
extern volatile __bit                   nPD                 __at(0x1B);	// @ (0x3 * 8 + 3)
#define                                 nPD_bit             _BIT_ACCESS(STATUS,3)
// PCON<nPOR>
extern volatile __bit                   nPOR                __at(0x471);	// @ (0x8E * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON,1)
// OPTION_REG<nRAPU>
extern volatile __bit                   nRAPU               __at(0x40F);	// @ (0x81 * 8 + 7)
#define                                 nRAPU_bit           _BIT_ACCESS(OPTION_REG,7)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// STATUS<nTO>
extern volatile __bit                   nTO                 __at(0x1C);	// @ (0x3 * 8 + 4)
#define                                 nTO_bit             _BIT_ACCESS(STATUS,4)
// PCON<nWUR>
extern volatile __bit                   nWUR                __at(0x473);	// @ (0x8E * 8 + 3)
#define                                 nWUR_bit            _BIT_ACCESS(PCON,3)

#endif // _PIC16F639_H_
